import matplotlib.pyplot as plt
import numpy as np
names = ["парковка","треуголник","круг","главная дорога","пешеходный переход","остановка и парковка запрешена","выезд на дорогу с односторонним движением >","направление движения по полосам","уступи дорогу","красные","жилая зона","тупик","полоса для обшественного транспорта","синие","сервисные","конец одностороннего движения","табличка |","табличка ","остановка автобуса табличка","дорога с односторонним движением","направление главной дороги","начало нас пункта бел с дом","конец нас пункта бел с дом","начало нас пункта бел ","конец нас пункта бел ","начало нас пункта син ","конец нас пункта син ","Сброс всех ограничений","платная дорога"]
data = [4423, 5423, 12733, 11323, 24252, 8986, 622, 11385, 4745, 4436, 869, 1292, 705, 8476, 3939, 945, 2719, 10783, 879, 1631, 2627, 2988, 2063, 3171, 1828, 3397, 866, 1722, 2988]


plt.style.use('_mpl-gallery-nogrid')


# make data
colors = plt.get_cmap('Blues')(np.linspace(0.1, 1, len(data)))

# plot
fig, ax = plt.subplots()
ax.pie(data, colors=colors, radius=3, center=(4, 4),
       wedgeprops={"linewidth": 1, "edgecolor": "white"}, frame=True, labels = names,autopct='%1.2f%%')

ax.set(xlim=(0, 8), xticks=np.arange(1, 8),
       ylim=(0, 8), yticks=np.arange(1, 8))

plt.show()